# Built In Failures Numbering Failures More Then One Element Was Changed Property

Source: https://www.revitapidocs.com/2026/c2100c62-775c-ee11-30af-3e5796466b68.htm

---

| Built In Failures Numbering Failures More Then One Element Was Changed Property |
| --- |

The operation lead to the renumbering of more then one element.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId MoreThenOneElementWasChanged { get; }
```

```
Public Shared ReadOnly Property MoreThenOneElementWasChanged As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ MoreThenOneElementWasChanged {
	FailureDefinitionId^ get ();
}
```

```
static member MoreThenOneElementWasChanged : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures NumberingFailures Class Autodesk.Revit.DB Namespace